// Lab7-5.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
using namespace std;

int sum(int i, int a)
{
	int c = a;
	while (a < i)
	{
		a += c;
	}
	if (a == i)
		return i;
	else return 0;
}

int main()
{
   
	int i, m, a;
	cout << "Enter your divisible:\n";
	cin >> i; 
	cout << "Enter your divisor:\n";
	cin >> a;


	m = sum(i, a);

	if (m != 0)
		cout << " This number difference on " << a;
	else 
		cout << " This number is not difference on " << a;
	return 0;
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
